import pandas as pd

zp_df=pd.read_csv('./test.csv')
list=['销售', '美工', '商务', '经理', '网店', '客服', '文员', '行政', '辅导', '总监', '讲师', '淘宝', '运营', '渠道', '支持', '市场',
      '文案', '财务', '前台', '人事', '主管', '店长', '管家', '专员', '海运', '人力', '业务', '网销', '咨询', '助理', '摄影', '房产',
      '平面', '产品', '报价', '课程', '视觉', '管理', '动漫', '动画', '顾问', '维修', '老师', '幼师', '干部', '司机', '策划', '制图',
      '营销', '出纳', '投资', '建筑', '信用', '库管', '执行', '股票', '操盘', '理财', '活动', '评估', '资金', '机械', '拍摄', '储备',
      '信贷', '专利', '会计', '编辑', '视频', '造价', '法律', '顾问', '林业', '电话', '售', '儿童', '插画', '统计', '天猫', '车', '猎头',
      '招商', '店', '测量', '美容', '单', '调度', '话务', '合伙', '技工', '贸', '药', '代表', '经纪', '推广', '客户', '社', '公关', '挑战',
      '医', '女', '男', '剪辑', '买', '记者', '销', '秘书', '服装', '购', '图', '师', '漫', '画', '集团', '商标', '保险', '广告', '兼职',
      '购', '交易', '风', '贷', '翻译', '仓库', '内勤', '暑假', '钣金', '管培', '美术', '软文', '法务', '竞价', '美', '收银', '空调', '食堂',
      '分拣', '健身', '施工', '录入', '创业', '配送', '质检', '种植', '校长', '护士', 'logo', '出差', '操作', '学管', '货代', '厨', '教务',
      '英语', '播', '教学', '供应', '艺人', '电工', '打印机', '校', '助教', '督导', '主持', '生产', '发酵', '私人', '后勤',
      '土木','卫生','调查','热线','号码','包装','文职','机票','政策','保洁','生物','仓管','影视','班主任','钟点','办公','夏季','教研',
      '杂志','定损','物流','呼叫','监管','接线','主任','梦想','院长','网红','焊工','负责人','家装','催收','营业','选题','检测','理货',
      '水，电','媒介','中介','考试','化验','绿化','客管','寻访','测评','幼儿','钳工','品控','厂长','驾驶','导演','西班牙','园林',
      '房东','网球','足球','篮球','乒乓','体育','保安','排版','保研','录音','普工','劳务','采编','摄像','工业设计','泥石流','stm','smt',
      '应付','总帐','设计','安防','快递','劳务','chat','发烧','电气','粤语','泰语','越南','马来西亚','检验','模切','品质','会玩',
      '抄表','指导','会展','座岗','审核','弱电','电梯','资料','厂区','db','关务','往来','账款','地质','勘察','配线','化学','代理商','宣传',
      '财 务','轮岗','报告','博览','我爱','陈列','暑期','bd','审核','编导','后期','礼宾','电商','报关','编剧','服务','日语','宽带',
      '样衣','艺术','馆长','机修','尝试','德国','德语','急聘','骑士','客情','安装','家','外勤','包商','资质','急召','票务','白酒',]
list2=['UI','网页','游戏','web','ui','java','python','.net','C#','C语言','C++','c语言','c++','c#','JAVA','PYTHON','.NET'
       ,'php','PHP','App','app','APP','数据库','MySQL','mysql','MYSQL','Web','sql','程序','vr','数据','seo','linux']
# for i in zp_df[5000:10000]['name']:
#     print(i)
def ershai(str1,l):
    for i in l:
        if i in str(str1).lower():
            return True
    return False
def yishai(str1,l):
    for i in l:
        if i in str(str1).lower():
            return True
    return False


cot=0
for index,name in zip(zp_df.index,zp_df['name']):
    if yishai(name,list)==True:
        if ershai(name,list2)==True:
            continue
        else:
            print('已删除第%s的数据' % index)
            zp_df.drop(index=index,inplace=True)
    else:
        continue

new_df=zp_df.reset_index()
print(new_df.to_csv('./简单筛选.csv'))

# print(zp_df)
# cot=0
# for index,name in zip(zp_df.index,zp_df['name']):
#     flag = False
#     for sx in list:
#         if flag:
#             break
#         else:
#             if sx in str(name).lower():
#                 for sx2 in list2:
#                     if flag:
#                         break
#                     elif sx2 in str(name).lower():
#                         flag=True
#                         print(name)
#                         cot+=1
#                 if flag==False:
#                     # print(name)
#                     # cot+=1
#                     flag=True
#     if flag==False:
    #     print(name)
    #     cot+=1
print(cot)

