import jieba
from pyspark.mllib.linalg import SparseVector,DenseVector,Vector
from pyspark.mllib.regression import LabeledPoint
from pyspark.ml.linalg import Vectors

city_dct={'铜陵': 1, '黄石': 2, '阜阳': 3, '石河子': 4, '南京': 5, '双鸭山': 6, '巴彦淖尔': 7, '枣庄': 8, '国外': 9, '张家港': 10, '昌吉': 11, '儋州': 12, '固原': 13, '宝鸡': 14, '河池': 15, '北海': 16, '娄底': 17, '日喀则': 18, '铁岭': 19, '贺州': 20, '岳阳': 21, '锡林郭勒盟': 22, '红河州': 23, '中卫': 24, '平顶山': 25, '韶关': 26, '本溪': 27, '徐州': 28, '临沂': 29, '六盘水': 30, '武威': 31, '怀化': 32, '辽宁省': 33, '抚顺': 34, '张家界': 35, '长沙': 36, '浙江省': 37, '沈阳': 38, '龙岩': 39, '阿坝': 40, '张家口': 41, '酒泉': 42, '西安': 43, '淮北': 44, '长治': 45, '喀什地区': 46, '榆林': 47, '吉安': 48, '汉中': 49, '丽江': 50, '开平': 51, '林芝': 52, '荆门': 53, '临汾': 54, '海西': 55, '迪庆': 56, '莱芜': 57, '萍乡': 58, '黔东南': 59, '滨州': 60, '防城港': 61, '清远': 62, '赤峰': 63, '洛阳': 64, '广安': 65, '衡阳': 66, '黄山': 67, '沧州': 68, '嘉峪关': 69, '内蒙古': 70, '绥化': 71, '无锡': 72, '杨凌': 73, '孝感': 74, '陵水': 75, '潮州': 76, '资阳': 77, '五指山': 78, '临夏': 79, '钦州': 80, '海南省': 81, '新疆': 82, '铜仁': 83, '南通': 84, '文山': 85, '漯河': 86, '邵阳': 87, '神农架': 88, '崇左': 89, '泰州': 90, '邢台': 91, '南平': 92, '周口': 93, '新乡': 94, '朝阳': 95, '盐城': 96, '商洛': 97, '许昌': 98, '日照': 99, '河源': 100, '哈密': 101, '开封': 102, '大连': 103, '桂林': 104, '赣州': 105, '来宾': 106, '锦州': 107, '信阳': 108, '营口': 109, '辽源': 110, '太仓': 111, '西昌': 112, '佳木斯': 113, '淮安': 114, '百色': 115, '丹阳': 116, '鹤壁': 117, '遂宁': 118, '西藏': 119, '常熟': 120, '昭通': 121, '仙桃': 122, '铜川': 123, '香港': 124, '苏州': 125, '兰州': 126, '乌海': 127, '黔南': 128, '河北省': 129, '泰兴': 130, '揭阳': 131, '巴音郭楞': 132, '昆明': 133, '福建省': 134, '威海': 135, '汕头': 136, '包头': 137, '杭州': 138, '遵义': 139, '十堰': 140, '临沧': 141, '烟台': 142, '江门': 143, '株洲': 144, '台州': 145, '商丘': 146, '承德': 147, '濮阳': 148, '湖南省': 149, '宜春': 150, '东方': 151, '南充': 152, '菏泽': 153, '黄冈': 154, '宿迁': 155, '太原': 156, '延边': 157, '呼伦贝尔': 158, '天津': 159, '保定': 160, '阜新': 161, '扬州': 162, '湛江': 163, '齐齐哈尔': 164, '和田': 165, '伊犁': 166, '成都': 167, '宿州': 168, '延安': 169, '嘉兴': 170, '广西': 171, '德州': 172, '靖江': 173, '郑州': 174, '安康': 175, '池州': 176, '宜昌': 177, '泉州': 178, '襄阳': 179, '晋城': 180, '葫芦岛': 181, '达州': 182, '自贡': 183, '南阳': 184, '海东': 185, '惠州': 186, '中山': 187, '肇庆': 188, '陕西省': 189, '舟山': 190, '鄂尔多斯': 191, '汕尾': 192, '湘西': 193, '宁夏': 194, '宁波': 195, '克拉玛依': 196, '宣城': 197, '泸州': 198, '山西省': 199, '塔城': 200, '新余': 201, '济源': 202, '厦门': 203, '绍兴': 204, '通辽': 205, '毕节': 206, '福州': 207, '青岛': 208, '茂名': 209, '甘肃省': 210, '义乌': 211, '三明': 212, '珠海': 213, '咸阳': 214, '贵州省': 215, '淮南': 216, '文昌': 217, '鹰潭': 218, '金华': 219, '辽阳': 220, '楚雄': 221, '抚州': 222, '永州': 223, '贵港': 224, '雅安': 225, '济南': 226, '德阳': 227, '淄博': 228, '兴安盟': 229, '廊坊': 230, '湖北省': 231, '延吉': 232, '合肥': 233, '石家庄': 234, '东莞': 235, '湘潭': 236, '银川': 237, '四川省': 238, '深圳': 239, '益阳': 240, '焦作': 241, '三亚': 242, '六安': 243, '黑龙江省': 244, '海宁': 245, '温州': 246, '三门峡': 247, '澄迈': 248, '重庆': 249, '广东省': 250, '衢州': 251, '常德': 252, '大理': 253, '怒江': 254, '济宁': 255, '山东省': 256, '滁州': 257, '大同': 258, '南昌': 259, '云浮': 260, '东营': 261, '马鞍山': 262, '晋中': 263, '河南省': 264, '曲靖': 265, '保山': 266, '聊城': 267, '吉林省': 268, '梅州': 269, '凉山': 270, '驻马店': 271, '伊春': 272, '荆州': 273, '丽水': 274, '玉林': 275, '鸡西': 276, '阳泉': 277, '景德镇': 278, '大兴安岭': 279, '呼和浩特': 280, '九江': 281, '西宁': 282, '黑河': 283, '阳江': 284, '内江': 285, '潜江': 286, '澳门': 287, '雄安新区': 288, '眉山': 289, '安阳': 290, '拉萨': 291, '吴忠': 292, '通化': 293, '青海省': 294, '昌江': 295, '燕郊开发区': 296, '南宁': 297, '昆山': 298, '台湾': 299, '咸宁': 300, '天水': 301, '漳州': 302, '绵阳': 303, '郴州': 304, '潍坊': 305, '莆田': 306, '白山': 307, '上海': 308, '陇南': 309, '江西省': 310, '玉溪': 311, '海口': 312, '唐山': 313, '': 314, '乌鲁木齐': 315, '上饶': 316, '邯郸': 317, '衡水': 318, '安徽省': 319, '广元': 320, '亳州': 321, '天门': 322, '白银': 323, '泰安': 324, '牡丹江': 325, '西双版纳': 326, '安顺': 327, '运城': 328, '镇江': 329, '鄂州': 330, '长春': 331, '贵阳': 332, '哈尔滨': 333, '乐山': 334, '随州': 335, '博尔塔拉': 336, '德宏': 337, '乌兰察布': 338, '石嘴山': 339, '克孜勒苏柯尔克孜': 340, '梧州': 341, '北京': 342, '蚌埠': 343, '巴中': 344, '广州': 345, '江苏省': 346, '盘锦': 347, '邓州': 348, '丹东': 349, '柳州': 350, '大庆': 351, '宁德': 352, '阿克苏': 353, '佛山': 354, '芜湖': 355, '攀枝花': 356, '普洱': 357, '鞍山': 358, '四平': 359, '庆阳': 360, '常州': 361, '恩施': 362, '云南省': 363, '松原': 364, '吉林': 365, '宜宾': 366, '朔州': 367, '甘孜': 368, '黔西南': 369, '秦皇岛': 370, '安庆': 371, '张掖': 372, '武汉': 373, '渭南': 374, '湖州': 375, '连云港': 376}
lable_dct={'高级软件工程师': 1, 'android': 2, '数据库工程师': 3, '软件工程师': 4, '前端': 5, 'ui': 6, '区块链': 7, '算法': 8, '网页设计/制作/美工': 9, '系统架构': 10, '人工智能': 11, '游戏开发': 12, '数据分析': 13, '机器视觉': 14, '大数据': 15, '计算机': 16, '软件测试': 17, '网络管理': 18, '嵌入式软件': 19, '手机应用': 20, '电路工程': 21, '运维': 22, '射频工程': 23, '高级硬件工程': 24, 'erp实施': 25, '数据挖掘': 26, '电子技术': 27, '嵌入式硬件': 28, '自动化': 29, '电子工程': 30, '单片机': 31, '通信': 32, '系统集成': 33, 'java开发': 34, '硬件测试': 35, '半导体': 36, '电气工程师': 37, 'web': 38, '物联网': 39, '深度学习': 40, '集成电路': 41, '系统工程师': 42, '硬件工程师': 43, '硬件': 44, '安卓': 45, 'cocos2d-x': 46, '系统测试': 47, 'ios': 48, 'flash': 49, '网络安全': 50, '软件': 51, '机器人': 52}


def test(x):
    return x[0].append(x[1]).append(x[2]).append(x[3])


def city_trans(city):
    return city_dct[city]

def lable_trans(lable):
    return lable_dct[lable]


def text_division(text):
    stopwords1 = [line.rstrip() for line in open('./中文停用词库.txt')]
    stopwords2 = [line.rstrip() for line in open('./哈工大停用词表.txt')]
    stopwords3 = [line.rstrip() for line in open('./四川大学机器智能实验室停用词库.txt')]
    stopwords4 = [' ', '高薪', '招', '吃', '爆棚', '芜湖', '郑州', '合肥', '过万', '饭补', r'\xa0', '天津', '新手', '新人', '地铁', '名企', '学徒',
                  '3500',
                  '|', '\xa0', '年', '~', '●', '◆']
    stopwords = stopwords1 + stopwords2 + stopwords3 + stopwords4
    seg_list = jieba.cut(str(text), cut_all=False)
    meaninful_words=[]
    for word in seg_list:
        if word not in stopwords:
            meaninful_words.append(word)
    return meaninful_words

def desp_text_division(text):
    valid_word = ['开发', '熟悉', '工作', '经验', '能力', '设计', '相关', '负责', '工程师', '技术', '项目', '优先', '产品', '系统', '要求', '良好', '测试',
                  '公司', '具有', '团队', '完成', '进行', '使用', '沟通', '专业', '软件', '以上学历', '熟练', '分析', '任职', '需求', '具备', '维护',
                  '精通', '编写', '强', '数据库', '了解', '应用', '岗位职责', '文档', '优化', '框架', '学习', '管理', '问题', '参与', '独立', '平台',
                  '能够', '数据', '编程', '计算机', '前端', 'Java', '代码', '合作', '中', '研发', '客户', '熟练掌握', '调试', '提供', '硬件', '精神',
                  '一定', '业务', '实施', '性能', '本科', '岗位', '解决', '网络', '架构', '掌握', '自动化', '职位', '实现', '语言', '责任心', 'Android',
                  '流程', '电子', '较强', '常用', '行业', '新', '基础', '方案', '软件开发', '算法', '设备', 'Web', '员工', '功能', '模块', '工具',
                  '用户', '至少', '培训', '处理', 'SQL', '过程', '大专', '考虑', '服务', '主流', '规范', 'Linux', '协助', '前端开发', '资格', '高级',
                  '理解', '任务', '配合', '一种', '协作', '运维', '端', '协调', '网站', '知识', '制定', '计算机相关', '福利', '环境', '意识', 'C++',
                  '移动', '包括', '质量', '原理', '服务器', '通信', '页面', '发展', 'C', '游戏', '善于', 'and', '安装', '日常', '互联网', '销售',
                  'JAVA', 'CSS', '压力', '研究', '扎实', '编码', 'Oracle', 'PHP', '解决问题', '制作', '优秀', '五险', '配置', '部门', 'IT',
                  '活动', '类', '双休', 'JavaScript', '组织', 'UI', '实际', 'java', '接口', '协议', '指导', '执行', '操作', '技术支持', '职责',
                  '高', 'web', '软件测试', '规划', '安全', '一金', '习惯', '操作系统', '计划', '架构设计', '体验', '标准', '程序', 'HTML', '故障',
                  '核心', '快速', '部署', 'Spring', '人员', '跟踪', 'MySQL', '交互', '丰富', '电路', '企业', '开源', '嵌入式', '带薪', '搭建',
                  'C#', '监控', '解决方案', '电气', '方法', '控制', '现场', '假', 'HTML5', '后台', '各类', '深入', '描述', '工程', '大型', '运行',
                  'iOS', '出差', '改进', '生产', '10', '提升', '法定', '编号', 'NET', '逻辑', '支持', '提出', '视觉', '及时', '经理', '方面',
                  '时间', '技能', '设计模式', '承受', '撰写', '运用', '完善', '节假日', '安排', '从事', '保证', '测试用例', '存储', '领域', '办公', '确保',
                  'APP', '00', '信息', '运营', '持续', '表达能力', '定期', '一年', 'PCB', '建设', '承担', '强烈', '项目经理', '驱动', '相应', '客户端',
                  '单片机', '微信', '调优', '多线程', '专业本科', '浏览器', '国家', '体系', '旅游', 'js', '热爱', '验证', '界面', 'Python', '积极主动',
                  'linux', '方向', '薪资', '需要', '补贴', '毕业', '适应', '逻辑思维', '市场', '积极', '脚本', '机制', '网页', '手机', '整体', '结构',
                  '常见', '项目管理', '评估', '数据分析', '选型', '主要', '产品开发', '内部', '进度', 'WEB', '通讯', '集成', 'ERP', '领导', '接受',
                  '组件', '详细', '整理', '英语', '三年', '福利待遇', '报告', '创新', '分布式', '30', '享受', '数据结构', '两年', '待遇', 'MVC', '拥有',
                  '号', '定位', '开发技术', '目标', 'TCP', '程序开发', '英文', '阅读', '智能', '内容', 'JS', '晋升', '毕业生', '责任感', 'J2EE',
                  '思维', 'IP', '专科', '团队精神', '提高', '编制', '嵌入式软件', '原理图', '面向对象', '设计师', '资料', '理论', '地点', 'Server', '模型',
                  '发现', 'Javascript', '开发工具', '风格', '学历', 'Ajax', 'mysql', '节日', '云', 'of', '周末', '金融', '软件工程', 'in',
                  '踏实', '机器', '调研', '升级', '抗压', '并发', '有效', '反馈', '布局', '上线', '机会', '情况', '建立', '软硬件', '薪酬', '建议',
                  'IOS', '单元测试', 'net', '月', '现有', '模拟', '开发人员', '认真', '交流', '经历', 'to', '全日制', '版本', '评审', '\u3000',
                  'CSS3', '文件', '奖金', '构建', 'the', '应届', '模式', '背景', '关系', '编程语言', '缺陷', '清晰', '态度', 'C语言', '缓存',
                  '测试计划', '思想', '测试工具', '部分', '产品设计', 'Mysql', '条件', '数学', '系统集成', 'Windows', '每年', 'XML', '主动', '电路设计',
                  '总结', '职业', '吃苦耐劳', '建模', '收集', 'Redis', '具体', '功底', '提交', '跟进', '空间', '功能模块', '售前', '规定', '合理', '推动',
                  '年度', '高效', 'H5', 'HTTP', '测试报告', 'S', '严谨', '路', '交付', '不断', '高度', '正常', '发布', 'with', 'jQuery',
                  '18', '完整', '更新', '多种', '小时', '地址', '简历', '上级', 'ARM', '12', '技巧', '实习生', '基础知识', '天', '链', '各项',
                  '美术', '效率', 'Tomcat', '做', 'python', '语句', '认真负责', 'com', '机器人', '推广', '稳定', '限', '电商', '招聘', '钻研',
                  '软件产品', '资源', '高质量', '方案设计', '芯片', '软件设计', '修改', '体检', '11', '特性', '主管', '以下', '软件系统', 'PLC', '售后',
                  'Hibernate', '细致', '机械', '兼容性', '热情', '效果', '维修', '加入', '数据挖掘', 'oracle', '免费', '带领', '区块', '计算',
                  '保障', 'B', '假期', '检测', '交办', '对接', 'JQuery', 'React', '加班', '做好', 'PC', 'css', '联网', '深度', '底层', '岁',
                  '工业', '网络设备', '应用软件', 'FPGA', '中级', '交通', '表达', '富有', '应届生', '动手', '视频', '欢迎', '兴趣', '电脑', '挖掘', '面试',
                  '请', '型', 'javascript', '硕士', '策略', '复杂', 'SDK', '工作制', 'spring', '大学本科', 'android', '综合', '服务端',
                  '信息化', '购买', '作品', '程序设计', '库', '验收', '网络安全', '需', '汽车', '二', '分享', '教育', '电话', '记录', '策划', '攻关',
                  '助理', '耐心', '中心', '认证', '稳定性', '理解能力', 'sql', '仿真', '科技', '入职', '生日', '医疗', '引擎', '出现', '射频', '\\',
                  '有过', '数字', '初级', '年终奖', 'Vue', '补助', '工艺', 'App', 'html', '交换机', '数字电路', '开展', 'API', '准确', '执行力',
                  '\t', '敏捷', '保险', '元', '架构师', '自我', '聚餐', '机电', 'Hadoop', '成长', '输出', '简单', '遇到', 'a', '统招', '讨论',
                  'for', '图像处理', 'jquery', '享有', 'ASP', '创意', '长期', 'or', '满足', '改善', '统计', '成员', 'redis', '方式',
                  'shell', '实习', 'Net', '高性能', 'bug', '元器件', '不定期', '功能测试', '备份', '施工', '敬业精神', '响应', '符合', '终端', '中间件',
                  '化', '路由器', '做事', '成功', '场景', '风险', '数据处理', '挑战', '培养', '思路清晰', '拓展', '区域', '资深', '计算机软件', '激情', '较大',
                  '安卓', '竞争力', '13', '工资', '数据仓库', 'http', '全面', '认识', '产假', '关注', '一起', '美工', '分配', '弱电', '帮助', '主导',
                  '管理工作', '器件', '喜欢', '排除', '级', '报表', 'AJAX', 'Photoshop', '氛围', '愿意', '说明', '深刻理解', '电源', '咨询', '图像',
                  '技术难题', '信息系统', '投递', '推进', '调整', '应用服务器', 'CAD', '有限公司', '公众', '测试环境', '脚本语言', '审核', '语言表达', '物',
                  '乐于', '结合', 'JSON', '绘制', '利用', '识别', 'ORACLE', 'Jquery', '动画', '住宿', '程序员', '原型', '实践经验', '防火墙',
                  '更佳', '提成', 'php', 'SpringMVC', '更', '电子产品', '底薪', '婚假', '消息', 'vue', '布线', '制造', '图纸', '集群', '阶段',
                  '面向对象编程', '录用', '重构', '管理工具', '一门', '修复', 'experience', '本科学历', 'JSP', '负载', '分布式系统', '休息', '管理系统',
                  '网络通信', '把握', '内存', 'Bootstrap', '意见', '年龄', '人才', '均', 'app', '每月', '案例', '人工智能', '细心', '品牌', '图片',
                  '电力', '机房', 'ETL', 'MYSQL', '礼品', '整个', 'Socket', '概要', '支付', '信息安全', 'Struts', '懂', '开发进度', '系列',
                  '营销', '仪器', '加', '保持', '层', '迭代', '深刻', '公积金', '缴纳', '系统分析', '证书', 'MES', '社保', '思考', '绩效', '定制',
                  '成本', 'Spark', '表现', '定义', '二次开发', '技术开发', '参加', '图', '确认', '实践', 'SVN', '一次', '自学能力', 'BUG', 'DIV',
                  '专员', '病假', '同事', 'EMC', '监督', 'Shell', '制度', 'DSP', '水平', '难点', '说明书', 'windows', '主动性', '第三方', '渠道',
                  'www', '测试方法', '银行', '排查', '动态', 'html5', '平面设计', '兼容', '文化', '上海', '微', '安防', '集团', 'Mybatis',
                  'MyBatis', '生育', '注重', '设计方案', 'OA', '调薪', '整合', '信号', 'W3C', '命令', '从业', '电气工程师', '桌面', '采集', '总监',
                  'c', '应聘', '电子信息', '站', 'GIS', 'MySql', '虚拟化', '后期', '关键', 'Flash', '协同', '顾问', '最新', '电机', '放宽',
                  '上班时间', 'ios', '很强', 'BI', '17', '采购', 'MongoDB', 'Nginx', '理念', '商业', '正式', '网络协议', '年终奖金', '控件',
                  '传感器', '共同', '绩效奖金', '应用程序', '检查', '一体化', '开发者', '上进心', '可靠性', '亦可', '指标', '控', '课程', 'design',
                  'development', '文字', '服务器端', '非', '性', 'Unix', '礼金', '追求', 'Eclipse', 'is', '软件架构', '可行性', '素质', 'on',
                  '含', '奖励', '餐补', '材料', '激励', '辅助', '之间', '服从', 'MCU', '包', '无线', '广阔', '敬业', '财务', '功能设计', '奖', '移植',
                  '健康', '3D', '自主', '广告', 'Git', '模块化', '落地', '邮箱', '发放', '支撑', '海量', '异常', '优秀者', '可用', '设置', 'AI',
                  '打印机', '重要', '体系结构', '供应商', '可用性', '智能化', '系统软件', '书写', 'mybatis', '确定', '端的', '上班', '五天', '目前', '归档',
                  '国内', '内核', '转正', 'react', '计算机专业', '进取心', '决策', '专业知识', '擅长', '控制系统', 'ajax', '性格开朗', '范围', '年底',
                  '直接', '价值', '扩展', '适配', '智慧', 'BOM', '三', '计算机网络', 'git', '尤佳', '查询', '住房', '特点', '限于', '任务分配', '华为',
                  '教学', '下午茶', '15', '北京', '蓝牙', '跨', '短期', '流行', '探索', '业务流程', '获得', '时', '对系统', '理工科', '编辑', 'server',
                  '给出', '物流', '线上', 'Angular', '思路', '系统维护', '准备', '负责人', '式', '比较', '14', '推荐', 'Framework', '广州',
                  'bootstrap', '楼', '界面设计', '兼容性问题', 'SPI', 'DB2', '失业', '深圳', '前期', '运动', '五年', '大型项目', '技术员', '存在',
                  '封装', '选择', 'STM32', '前沿技术', 'SAP', '均衡', '进程', '大厦', '大规模', '感兴趣', 'Objective', '汇报', 'c++', '联系方式',
                  '重点', '联系电话', '生活', '总线', '中国', '签订', '电子商务', '项目组', '每天', '产品质量', '电子电路', 'tomcat', '形成', '客户服务',
                  '城市', '通信工程', '点', 'Apache', '示波器', '量产', 'CAN', 'Servlet', 'IC', '通用', '年休假', '细节', '宣传', '国际',
                  'SQLServer', '常规', '20', '展示', '每周', '机', '多个', '数据库系统', '客户关系', '日', '大学', '上级领导', '联系人', '合同',
                  '基本工资', '非标', '变更', '店铺', '分项', '计算机科学', '标准化', '满', '运作', '焊接', '演示', '给予', '乐观', 'Hive', '统一', '出',
                  '周一', '任意', '信号处理', 'webpack', '丰厚', '特别', '日语', 'Node', '外', '未来', 'R', '售后服务', '品质', '成熟', '见解',
                  'skills', '实时', '诚实', '巡检', '素养', '可视化', '注释', '语音', '佳', '信息技术', '敏锐', '二年', '创新能力', 'team', '涉及',
                  '关键技术', '周五', '预研', '逻辑性', 'test', '局域网', '成为', 'UML', 'software', '◆', '原生', '优秀员工', '想', '舒适', '自动',
                  'AngularJS', '厂商', '绘图', '开发计划', '必要', '业务部门', 'NoSQL', 'hibernate', '状态', '技术培训', '岗', '期间', '工程项目',
                  '前台', '希望', '分析师', '单元', '判断', '申请', 'USB', '业界', 'socket', '日志', '恢复', '联调', 'Maven', '安全性', '重大',
                  'system', '电子相关', '活跃', '上位', '最好', '构架', 'Bug', '读写能力', '网络管理', '样机', '数据中心', '网络系统', '结构设计', '投标',
                  '爬虫', '网络管理员', '自动控制', '院校', 'work', '基本原理', '努力', '丧假', '实施方案', '语义', '控制器', '休假', '敏感', '汇总', '下午',
                  '深', 'LINUX', '极强', '勤奋', '应急', '考核', '路线', '音视频', '集体', '办公设备', '审美', '沟通交流', '试用期', 'JVM', '单位',
                  'ES6', '业绩', '趋势', '适当', '周岁', '分离', '左右', '语法', '访问', '美化', '试验', '落实', 'as', 'PPT', '编程技术', '月薪',
                  '信息工程', '35', '医疗保险', '国内外', '色彩', '在线', '常用命令', '生命周期', '社会保险', '书面', '容器', '…', '弹性', '海外', '全',
                  'CRM', '参数', 'nginx', '开拓', 'I2C', '假日', '仪表', 'Dreamweaver', '模板', '路由', '测试人员', '万', '诊断', 'Studio',
                  '应', '易用性', 'VB', 'SSH', '装配', 'DOM', '有大', '概念', '人性化', '基本操作', '高速', '致力于', '年终', '解析', 'Html',
                  '静态', '编译', '政府', '期待', '午餐', 'XHTML', '积累', '组织协调', '梳理', '创业', '达到', '行为', '疑难问题', '勇于', '核心技术',
                  '手册', 'hadoop', '电气设计', '接入', '写', '包含', '联系', '规则', '整机', '灵活', 'Illustrator', '前', '已有', 'EDA',
                  'MS', '混合', '统计学', '线', '用例', '函数', '四级', '外部', '工厂', '生日会', '信息管理', 'Experience', 'cn', '电气工程',
                  '职业道德', 'A', 'Engineer', '中专', '专家', '制图', '商城', '迅速', '入', '车载', '机械设计', '面向', '板', '做过', 'Service',
                  '会议', '线路', '角度', '物料', '规格', '加工', 'QT', '全勤奖', 'x', '技术人员', '大学专科', '理论知识', '电路板', '传输', '实行',
                  'OOP', '总部', '制订', '4000', '设计规范', '●', '严格', '源码', '优质', '28', '类产品', '成果', '宿舍', '间', '室', '次',
                  'svn', 'AD', '六', '软', '事务', '商务', '劳动合同', '后端', '一款', '类库', '电信', '网管', '按计划', '通道', '口头', '导入',
                  '漏洞', 'l', 'SOA', '图形', '研究生', '关系数据库', '全国', '制', '格式', '浓厚', '地图', 'SERVER', '通信协议', '特效', '季度',
                  '手游', '媒体', '优厚', '对应', '战略', '★', 'years', '产品线', '八小时', '5000', '多媒体', '实战经验', '回归', '讲解', '引导',
                  '部', 'PS', 'WebService', '光学', '岗前', '队列', '商品', '管控', '最终', '浓厚兴趣', 'UART', '双薪', '插件', '注', '对外',
                  '调用', '组装', 'Visual', 'css3', '外设', '供应链', 'LED', 'office', '绩效考核', 'Unity3D', '指定', 'Good', '急聘',
                  'Kafka', '物理', '栋', '网络故障', '大中型', '专题', '商业保险', '作业', 'PADS', '搜索', '数据模型', '达成', '保持良好', '优势', '归纳',
                  '津贴', '事业', '小组', '事业心', '子系统', '独立思考', '社区', '微波', 'English', '号线', '表', '导航', '配置管理', '大道', '触发器',
                  '充满', '运营商', '带薪休假', '出色', '光伏', '渲染', '春节', '三维', '公司地址', '统计分析', '满意度', '能看懂', '上架', '命名', 'mvc',
                  '7.5', '仪器仪表', '接收', '事项', '诚信', '讲师', '团建', '政策', 'Weblogic', '交代', '深圳市', '抽象', '求知欲', '带', '分类',
                  '面议', '经营', '心态', 'Docker', '串口', '分', '机构', '211', '跨平台', '储备', '2018', 'nodejs', '瓶颈', '淘宝', '测试数据',
                  '临时', '处理器', '转化', 'IO', '潜在', '责任', '流', '班车', '音频', '量化', 'Native', '自然语言', '模式识别', '投', '工程化',
                  '成立', '融入', '介绍', '懂得', 'communication', '栈', '邮件', '西门子', '事件', '广州市', '交易', '总体', '工伤', 'Altium',
                  'json', 'DBA', 'knowledge', '天线', '自定义', 'Office', '学生', '梦想', 'technical', '招投标', '改造', '设施',
                  'Layout', '远程', '平面', 'HBase', '读写', '零售', '外围', 'Html5', 'Sql', '集合', '补充', '共享', '阿里', 'flash', 's',
                  '全球', 'Struts2', '想法', '文案', '分解', '轻松', '创建', '办理', '样品', 'gulp', '交换', '出口', '资产', '原因', 'Matlab',
                  '类型', '系统优化', 'mongodb', '部件', '打造', '零', '空调', '网', '原则', '知名', '后续', '关怀', '深厚', 'framework',
                  '管理软件', '中高级', 'layout', '两种', '官网', 'iPhone', 'Protel', '美术设计', 'dubbo', '实验', '版本控制', '进', 'UDP',
                  '即可', '6000', 'PL', '985', '规范化', '事宜', '实验室', 'SqlServer', '基本知识', '线程', '流量', '正规', '调度', '学员',
                  '期权', '身体健康', '周', '一家', '权限', '展现', 'DC', '解答', '分公司', '兼容问题', '分析仪', '进入', 'sqlserver', 'Cloud',
                  '异步', 'spark', '性格', '年薪', 'node', '广场', '开放', '投资', '检验', '电控', 'Dubbo', '每个', '事物', 'MQ', '测量',
                  'Excel', '前沿', '月度', 'project', '零食', '驱动程序', 'boot', '做出', 'MVVM', '专业技能', '养老保险', 'xml', '肯干', '索引',
                  'angular', 'be', '环节', '专注', '系统实施', '胜任', '养老', '更好', 'management', 'Designer', '进展', '伺服', '用户界面',
                  '建筑', '修正', '变频器', '清洗', '保养', '四', '客服', '人际沟通', 'OS', '意愿', '可靠', '正直', '促销', '上午', '分红', '集成电路',
                  '源代码', '试产', '先进', '遵守', '发展趋势', '附近', '备注', '年限', '工作效率', '技术规范', '早', 'etc', '迁移', '数据备份', 'c#',
                  'Perl', '专业培训', '25', '明确', '工伤保险', '无线通信', 'b', '师', '有所', 'cocos2d', '固件', '措施', '学校', 'HR', '工龄',
                  '51', '变化', 'WPF', 'related', '尤其', '车辆', '打包', '职能', '认真细致', '保证系统', '追踪', '类似', '往届', '户外',
                  'Cadence', '地铁站', '医院', 'WIFI', '员', '公交', '手段', '得到', '3000', '额外', '紧密', '应变能力', '写作能力', 'Storm',
                  '完整性', '日本', '运行机制', '男女', 'IDC', '武汉', '程度', '传统', '经验丰富', 'maven', '深入研究', '企业级', 'plus', 'support',
                  'Json', '合适', '网络通讯', '调', '管理制度', '周边', '样式', '测控', '陪', '六险', '系统管理', '两个', 'data', '基础架构', '两次',
                  '产生', 'asp', '数据管理', '费用', '提取', '合作伙伴', 'product', 'AutoCAD', '金', '万用表', 'Memcached', '晚', '方', '薪',
                  '正确', '创造', '审查', '市场营销', '诚聘', '一经', '台', '版图', 'ibatis', '为主', '水果', '棋牌', '8000', '整改', '融合', '预算',
                  'EE', '微软', '杭州', '实训', '亲和力', '计算机硬件', '结婚', 'UNIX', '促进', '故障诊断', '大小', '微电子', '40', '开朗', '股权',
                  '位', '年会', '互动', 'degree', '具', 'D', 'customer', '举办', '高强度', '美工设计', '收入', 'will', '渗透', '担任', '主机',
                  '积极向上', 'lua', '一项', '手机游戏', '开关电源', '网址', '办公室', '病毒', '寻找', '4G', '软件技术', '汇编语言', '层面', '险', '同步',
                  '员工福利', '状况', '24', 'cloud', '当前', '创造力', '电路图', '驾驶', '年轻', '为佳', 'BMS', 'testing', '全过程', '转换',
                  'struts', 'V', 'Boot', '元件', 'Hbase', '事业部', '多层', '清单', '适应能力', '自控', 'VUE', '转行', 'Go', '主要职责',
                  'WCF', '便利', '补', '谈判', '差异', '增加', '上岗', '组建', '监测', 'jsp', '科学', '预测', '组态', '雷达', '排错', '请求', '排版',
                  'Responsible', '国外', '羽毛球', '对象', '工控', '丰富多彩', '产业', '基金', '朝九晚', 'RF', '组长', '已经', '工作餐', '专利',
                  '足够', '系统安全', '竞争', 'WMS', '应对', '成都', 'service', '录取', '基础设施', '文本', '流利', '授课', '单', '敏感度', '有意者',
                  '面向对象分析', '设有', '训练', '冗余', 'VPN', '有无', '订单', 'MFC', '强大', '半年', '本科毕业', '控制算法', 'Verilog', '定位问题',
                  '特征', '应聘者', '数据安全', '齐全', '高新区', '统筹', '挑战性', 'Xcode', 'JDBC', '一份', 'Webpack', '防护', '数据量', '总体设计',
                  '专项', '辅导', 'SQLSERVER', '领先', '导向', 'NodeJS', '有志于', 'E', '书', 'div', '门店', '16', '顺利', '管理体系', '是否',
                  'working', '部门经理', '合理化', '基础理论', '我司', 'GUI', '重视', '形象', '智能家居', '视频会议', 'SAS', 'CCNP', 'kafka',
                  '及时处理', '就业', 'VC', '及时发现', '过节', '按质', '区', '制造业', '基本功', '平板', '适合', '切图', '领悟', '高可用性', '名称', '金蝶',
                  '熟知', '半导体', '说', '电气控制', '复用', '礼物', 'other', 'UE', '认知', '相机', '角色', 'weblogic', '加薪', '100', '采用',
                  '形式', '视图', '自测', '报销', '配套', '所属', '加载', 'MSSQL', '触摸屏', '听说读写', '特殊', 'photoshop', '500', '米', '保护',
                  '力', 'are', 'IBM', 'PostgreSQL', '科技园', '可维护性', '吃苦', '应用层', '意向', '位于', '级别', '接触', 'perl', '食宿',
                  '三菱', '技术标准', '生日礼物', '电器', 'H3C', '快', '控制软件', '博士', 'CET', '下车', 'WebLogic', '组', '老师', '规划设计',
                  '无线网络', 'Design', '划分', '分布式计算', '代表', '充电', '担当', '关键问题', '有着', '电池', '证券', 'preferred', 'RabbitMQ',
                  '图标', '零部件', '洞察力', '欲望', '响应速度', '放假', '性别', 'Microsoft', '生产线', '手写', '厂家', 'business', '装修',
                  'Cocos2d', 'angularjs', 'VR', '监理', 'Unity', 'LTE', 'e', '世界', '精英', 'new', '高端', 'OpenCV', '50', '―',
                  '分析测试', 'Familiar', '易', '小姐', '标书', '独特', '公共', '搜索引擎', '手机软件', '获取', '南京', 'Swift', '系统管理员',
                  '嵌入式操作系统', '届', '功率', '调测', '经济', '主持', '产品销售', '率低', 'Strong', '优越', '主题', '五', '号楼', 'memcached',
                  'OFFICE', 'SpringBoot', '设计图', '紧密配合', 'ThinkPHP', '娱乐', '定时', 'Ruby', '好学', '现', '黑盒', '常用软件', 'K',
                  '白盒', '消息中间件', '超过', '多年', '急招', '车', '资质', '1.2', 'eclipse', '生产工艺', '天河区', '行政', '立项', '外派', 'GIT',
                  '餐饮', '三层', '园区', '生态', 'Zookeeper', '代理', 'Mobile', '显示', '驻场', '可扩展性', '外出', 'zookeeper', '充满热情',
                  '共同完成', '汇编', '电', 'Asp', 'docker', '自我管理', '周期', '抓取', 'application', '天猫', 'CPU', '思科', 'Jenkins',
                  '规模', '进取精神', '地区', 'hive', '创意设计', '产品软件', '全栈', 'iBatis', '开发新', '产出', '1.3', '引入', '前瞻性', '计算机系统',
                  '一线', '单板', '面对', '抽取', '上市', 'at', '匹配', '技术水平', '攻克', 'tcp', '扩展性', '整车', '提炼', '网络工程', '计算机技术',
                  '高效率', 'memcache', '社会', 'FLASH', '产线', '竞争对手', '保质保量', '13054297606', '热衷于', 'hr', 'unix', '生物',
                  '直播', '唐普', '分钟', '以太网', '午休', '逆向', '职后', '出国', '研讨', '速度', '食堂', '积极进取', '楼宇', '优等', 'GPS',
                  'Software', '2.3', '文献', '高温', '百度', '!', '手绘', '生成', '结构化', 'WINDOWS', '用友', 'VS', 'Http', '评价',
                  '门禁', 'CI', '优雅', '构思', '安规', '工具软件', '全程', '稳重', 'requirements', '300', '面谈', '增强', '竣工', '管理机制',
                  '路径', '事情', '图像识别', '写作', '代码优化', 'SSM', '客户资源', 'nosql', 'Css', '爱', '光电', '合理性', '经费', '001', '公平',
                  '激光', '填写', 'analysis', '名', '项目前期', '降低', '为人正直', '理工类', 'apache', '标签', '网络平台', 'Memcache', '调查',
                  '影响', '32', '持有', 'U3D', '设定', '和谐', 'have', '时请', '内外', '初步', '中秋', '几种', '摄像头', 'MTK', 'h5',
                  'Axure', '尝试', '谢谢', '用于', '贡献', '每日', 'JBoss', 'EMI', '无人机', '举行', '2008', '文件系统', '最优', '口语', '旗下',
                  '合格', '相当', 'systems', '家', '设计者', 'programming', '同行业', 'quality', 'TI', 'RS232', '人际关系', '一位',
                  'DNS', '开发软件', '内外部', 'JAVASCRIPT', '试制', 'JavaEE', '个性化', 'tools', '稿', 'T', '连接', '个性', '聚类', '勿扰',
                  '报价', 'LCD', 'webservice', '卓越', '普通话', 'io', '固定', '主板', '读懂', 'Bachelor', '目的', '餐费', 'WinForm',
                  'good', '逻辑设计', '校区', '子公司', '驾照', 'WebSphere', '加固', '链接', '项', '工作者', 'products', '编解码', '搜集',
                  'RESTful', '社交', 'such', '独到', '拜访', '覆盖', 'code', 'springMVC', 'FTP', '健全', 'WiFi', '思维能力', 'Gulp',
                  '网店', '勤奋好学', 'RS485', '扁平化', '组成', 'api', '伙伴', '顺利进行', '论文', '三遍', '200', '管理层', '全职', '行业软件',
                  'EasyUI', '突发事件', '域', '优良', '每位', 'LoadRunner', '时序', 'RPC', '保质', 'HP', 'EXCEL', '海报', '一对一', '审计',
                  '任一', '处于', '系统核心', 'RFID', '2017', '基站', '化等', '博客', '产品化', '中秋节', 'hbase', 'VMware', 'CCNA', '理想',
                  '保密', '视觉效果', '报警', 'Laravel', '参考', 'MATLAB', '成', '架设', 'SOC', '初期', '完美', '带来', '搭配', '22', '精准',
                  '规格书', '卡', '发掘', '不良', '融洽', '一流', '提前', '效果图', 'Mac', '突出', 'Scala', '最大', 'Job', '高校', '突发', '光',
                  '酒店', 'Word', 'including', '构成', '主程', '态度端正', '2.2', '针对性', '写字楼', 'LAMP', '新能源', '意外', '快乐', '多项',
                  'Cortex', '神经网络', '同等', 'review', '特定', '认可', 'Mongodb', '1.5', '系统故障', '模电', '组成员', '图形学', '产业园',
                  '转', '扫描', '之外', '硬件平台', '老', '连续', '操作手册', 'native', '医疗器械', '复印机', 'SPSS', 'Knowledge', '风控',
                  '软件应用', '人机交互', 'X', 'LNMP', 'Visio', '基带', '中型', '件', 'OpenGL', 'ability', '股票', '时代', '19', '测试软件',
                  '中午', 'qq', '电磁兼容', '工装', '防范', '常用工具', '高新技术', '质量保证', '增长', '跨部门', 'RTOS', '业内', '辖', '高中', '西安',
                  '休', '合伙人', '流媒体', '上市公司', 'network', '机软件', '答疑', '通知', '上述', '乘坐', '视野', 'our', '页', '网关', '京东',
                  'FAE', '在职', '学院', '站点', '元素', '清楚', '关联', 'QA', '应用服务', '仓储', '及运维', '度', '早上', '流程图', '正', '承压',
                  'springmvc', '低于', 'process', '动力', '容灾', '法律', '呈现', 'technology', '诚恳', '研发部', '网络游戏', '各大', '智能手机',
                  '甲方', '终端产品', '认同', '筛选', '大量', 'QTP', 'ui', '类别', 'go', '突破', 'NLP', 'github', '电子设计', '苏州', '新加坡',
                  'above', '下达', 'Jmeter', '万元', '反应', '标定', '活力', '档案', '使用手册', '电气设备', 'Restful', '软件缺陷',
                  'engineering', '苹果', '实习期', 'System', '小游戏', '错误', '布置', '攻击', '紧急', '数电', 'SQLite', '出具', '投诉',
                  '频谱仪', '各方', '5G', 'SEO', '业务知识', '腾讯', '拟定', '热', '开通', '二次', '软件平台', 'o', '携带', '调配', 'from',
                  'Golang', '微波炉', '节点', '主', 'Selenium', '研究院', '操守', 'AE', 'servlet', 'grunt', 'ip', 'BS', '大型软件',
                  '工作作风', '方法论', '肯', 'https', '家人', 'maintenance', '判断能力', '乘车', '极具', '拍摄', '引进', 'Yii', '守信', '北京市',
                  '管理员', 'sdk', 'by', '提供数据', '电气系统', '市场需求', '还原', 'PMP', '技术部', '聚会', 'Jboss', '45',
                  'Responsibilities', 'excel', '观念', '扫描仪', '广泛', 'Cisco', '灵活运用', '工艺流程', '篮球', '机型', '过节费', '协同工作',
                  '平均', 'Camera', '顺畅', '端午节', 'solutions', '数据系统', '程序代码', '加盟', '第一', 'ArcGIS', 'an', '文体活动', '模组',
                  '指令', '端正', '强者', '积极参与', '发生', '干部', '技术类', '电子行业', '结算', 'PLM', '查出', 'Review', '知识者', '2019', '包装',
                  '容量', 'Data', 'Engineering', 'you', '市场推广', 'ORM', '敏感性', 'AR', '产品图片', 'HMI', '全方位', '治理', '测试项目',
                  '供应', '技术创新', '规章制度', '里', '商务谈判', '宣讲', 'IIS', '打印', '09', '®', 'POS', '启动', '2D', '等级', '写出', '冰箱',
                  '姓名', '有薪', 'Qt', '环境优美', '..', 'that', '慰问', 'REST', '公司员工', '专研', '红包', '广东', '传达', '账号', 'Nodejs',
                  '上报', 'd', '2016', '有条理', 'DevOps', '走', '01', '软件维护', '运', '小型', 'ActiveMQ', '难题', '板卡', '动漫', '发',
                  '人力资源', '负责管理', '限制', '开', '存储系统', '做五休', '外地', '富于', '消费', 'HDFS', 'Lua', 'AUTOCAD', '周六', '进步',
                  '端午', 'VHDL', '强度', '分析判断', 'high', 'all', 'written', '高通', 'IIC', 'Andriod', '优', 'wifi', '基地', '联合',
                  '户外活动', '电力系统', '人数', '发送', 'EBS', '查找', '人士', '带队', '签证', '而定', '不断完善', '人事', 'ES', '回款', '上海市',
                  '一致性', 'SLAM', '功能性', '跨境', 'PCBA', 'Ibatis', '比赛', 'IAR', '缜密', 'GPU', '职', '自由', 'debug', 'zabbix',
                  '工作日', '正在', '好奇心', '用户手册', '影像', '达', '三个', '周边设备', 'Labview', 'Core', '供', 'environment', '初中级',
                  '人才培养', '抗', '组网', '武汉市', '小型机', 'STL', '摄影', 'familiar', '上下班', '公交站', '性质', '币', '优秀人才', '能源',
                  'NDK', '咖啡', '数模', 'performance', '1.1', '书写能力', '登记', '方便', 'PROTEL', '坚持', 'iPad', '技术咨询', '整体规划',
                  '勿', 'level', '注明', '疑问', '对大', 'X86', '人品', '上传', '临时性', '赴', '下属', '保障系统', '画像', 'Store', '美国', '住',
                  'Netty', '发挥', '步行', '论证', '属于', '有志', 'LAYOUT', '注册', '股份', '常见问题', '驱动器', '务实', 'Caffe', '薪水',
                  '总体方案', '相对', '汽车行业', '020', '桩', '研发部门', 'XCode', 'Keil', '简洁', '网络应用', '把关', 'PIC', '温馨', '意外险',
                  'UX', '改版', 'BSP', 'Computer', '慰问金', 'Work', '局域网络', '10000', '取得', '电工', '评测', '深化', '图形图像', '公寓',
                  '比特', 'ReactJS', '服务平台', '督导', '版', '加密', 'least', '照明', '安全漏洞', 'AIX', '青岛', '期望', '开阔', '休闲', '园',
                  '投入', 'protel', '投影仪', 'JNI', '师父', '规律', '更改', 'The', '失效', '裁剪', 'HTTPS', '人脸识别', '新兴', '一周', 'AWS',
                  '观察力', '会员', '整洁', '开发区', '入侵', '防病毒', '指导书', '笔记本', 'UPS', 'Hybrid', '消防', 'NIO', '查杀', 'QQ', '演讲',
                  '002', '数字化', '开发方法', '流畅', 'Delphi', '素材', '加班费', 'Fireworks', 'A座', '考勤', 'based', 'studio', 'AVR',
                  '科研', 'Chrome', '域名', '研制', '极致', 'golang', '积极性', '生日礼品', 'OOD', '热衷', 'Jsp', '有志之士', '二维', '柜',
                  '电磁场', '健身房', '3G', 'less', '逆变器', 'hardware', 'Object', '现在', '环保', '四年', '自助', '知识产权', '舞台', '代理商',
                  '接送', '系统配置', 'cocos', 'Django', 'Test', '虚拟', '授权', '仔细', '艺术', '人生', '工程设计', '候选人', '传真机', '推送',
                  '屏幕', '建设性', 'JMS', '2.1', '数量', '做到', '项目风险', '包住', '价格', 'Requirements', '阶段性', '感知', 'MapReduce',
                  '抓包', '饮料', '正确性', '仓库', 'ADC', '教师', '步进', '公安', '长沙', '工科', '团体', '进一步', '承接', '线下', '注意', '高额',
                  '完全', '条件者', '职业规划', 'Egret', '招标', '加密算法', '擅于', '总经理', '虚拟机', '发表', 'AOP', '支付宝', '软件园', 'g',
                  'matlab', '高新', '2000', '自信', '心理素质', '传统节日', '小伙伴', 'issues', '竞品', '重用', '操作命令', '运转', '图形界面', '约',
                  'understanding', '实战', '须', '读', '高频', '突出者', '可行', '资金', '上升', 'Sqlserver', '满意', '实力', '贺礼',
                  'strong', '体育', 'applications', 'projects', '友好', '周六日', 'script', 'required', '中文', '医学', '职称', '自行',
                  'CCIE', 'time', 'customers', '组合', '申报', '真实', '品行端正', '美观', '货币', 'IDE', 'B2B', '潜力', 'es6', '大牛',
                  'springboot', '工作进度', '想象力', 'easyui', 'SMT', 'I', '4500', '当月', '法规', '爱好', '交给', 'ElasticSearch',
                  '检修', '督促', 'struts2', '每季度', '话费', '预警', '1000', 'TP', 'EF', '思考问题', '分表', '接线', '中英文', '视', '后顾之忧',
                  'IE', '工作量', 'Unity3d', '找到', '传递', '模具', '资讯', '动向', 'solution', '配备', '程序模块', '人机界面', '呼叫', '条理性',
                  'BLE', '找出', '分层', 'end', '维和', '企业应用', '理解力', '设立', '知识库', 'SpringCloud', 'implementation', '新品',
                  '沉淀', '伤害', '附上', '上层', '竞赛', 'We', '知道', 'storm', '弘历', '加分', '拜师', '南路', '计算机操作', '在校', '成就', '高于',
                  'OpenStack', '款', 'word', '英语水平', 'QC', '通信接口', 'WebSocket', 'pc', '重复性', '手工', '离线', '细化', '最少',
                  '电子设备', '开放平台', '质量标准', '新区', 'ROS', '咨询服务', '电力行业', 'TypeScript', '集', '二级', '交易系统', '严格执行',
                  'Master', '发展前景', '90', '重庆', '值班', '工程施工', 'Websphere', '现代', 'SaaS', '现状', '娱乐活动', 'NOSQL', 'ADO',
                  '求职者', '存储设备', '骨干', '作', '装备', '单独', 'selenium', '公关', 'Github', '创造性', '亚马逊', '自有', '最优化', '性能指标',
                  '办公自动化', 'Developer', '26', '健身', '测试程序', '客户端程序', 'j2ee', '责任意识', '艺术设计', '感觉', '鼓励', '技术档案', '交待',
                  'CISCO', '东莞', '困难', '测绘', 'WORD', 'Support', '电视', 'develop', '直招', '安全设备', '本职工作', 'skill', '分割',
                  'CS', '客户经理', '渴望', 'DHCP', '资格证书', '审美观', '人际交往', '雇主', 'using', 'problem', '镜头', '东路', '扩容', '校园',
                  '爱岗敬业', '测评', '传播', 'O', '施工图', '无线电', 'Webservice', 'Backbone', '驱动力', 'platform', '办事处', '数据传输',
                  '公用', '适用', '处', '前来', '收集整理', '攻坚', '家电', 'ST', '生态圈', '疑难', '临床', '存档', '畅通', '包吃', '合理安排', 'up',
                  '俱乐部', '老客户', '短时间', 'PM', '中餐', '河南', '市场调研', '分析方法', '会计', '老板', '高科技', '队伍', 'WebGL', 'BT', '感',
                  '改良', '广域网', '行业标准', '数据交换', '广告设计', '地方', '后台程序', '平安', '登录', '运维及', '伺服电机', '熟练地', 'thinkphp', '群',
                  '动作', '心', '奋斗', '无锡', '2015', '课题', 'CDN', '软件工具', '谦虚', '性格外向', 'Jetty', '低', 'sass', 'Kubernetes',
                  '诱惑', '准确性', '完备', 'ESD', '电子线路', 'KVM', 'B2C', 'winform', '旅行', '购物', '按量', '洞察', 'Science', '更换',
                  '高压', 'Winform', '中有', '全员', 'WebApp', '信用', '原有', 'Cocoa', '公司简介', 'Loadrunner', 'ExtJS', 'ADAS',
                  '最高', '零件', 'IoT', '精益求精', '生日派对', '早九晚', 'Grunt', 'mobile', 'architecture', '输入', '低功耗', '沉稳', '配件',
                  'B座', '调休', '影响力', '消费者', '监管', 'responsible', '决策树', 'jmeter', '多元化', '排名', '配电', 'Be', '制程',
                  'technologies', 'jvm', '有线', '团结', 'You', '机顶盒', '并行', '英语口语', '电站', 'company', '价值观', '业余', '密码学',
                  '系统升级', '485', '夹具', '欧姆龙', '有物', '自动测试', 'BootStrap', 'language', '结束', 'control', '前景', '优缺点', '晚会',
                  '图表', '无需', '标准规范', 'PC机', '近', '量', 'TensorFlow', 'Js', '技术细节', '才华', 'DB', '普通', 'SoC', '费', '惊喜',
                  '同行', 'SOCKET', '攻防', '工业园', '演进', 'RTL', 'IM', '先', '常驻', '掌控', '家庭', 'Div', '西路', '南山区', '仪器设备',
                  '机械类', '工资待遇', '各个环节', 'ASIC', '分库', '研究员', 'Allegro', '实时操作系统', 'operation', '属性', '个人简历', 'Ability',
                  '关键词', 'OO', '储能', 'more', '欢迎您', 'JQUERY', '查看', '市场部', '收益', 'IDEA', 'Senior', '充足', 'IOT', '回访',
                  '偏', '光源', '有效性', '一到', '终端设备', '佛山', '基层', 'automation', '标注', '路口', 'Zepto', '公有', '严格遵守', 'EJB',
                  'nice', 'DW', '广大', 'Project', '想要', 'engineer', '接口协议', 'NoSql', 'computer', '单休', '共识', 'MyEclipse',
                  '封顶', '无限', '拓扑', 'teams', '前提', '回收', '全额', 'industry', '济南', '专职', '分布', '考试', '规范性', 'production',
                  'PowerDesigner', '灯具', '另有', 'Develop', '晚餐', '导师', '管理者', '数据通信', '系统工程', '房补', '成像', '内训',
                  'information', '详情', '保管', 'problems', '游', '真诚', '军工', '音响', 'provide', '纵向', 'LVS', 'Zabbix', 'M3',
                  '云端', '技术移民', '排障', 'Sybase', '依托', '4.0', 'Power', '外贸', '文档资料', '徒弟', '公开', 'Excellent', '穿戴',
                  '测试代码', '学', '进取', '主页', 'equipment', '集中', '2012', '资源管理', '控制能力', '店', '23', '各地', '一卡通',
                  'loadrunner', '功耗', '系', '信贷', '决定', '互联', '以人为本', '操作能力', '库存', '一天', '联络', '共创', '学位', '投放',
                  'AppStore', '爬山', '便捷', '符合规范', '7000', '小区', '重现', '门户', 'swift', 'NC', '三餐', 'GSM', '实际操作', '实操',
                  '地理信息系统', '银行业务', '基本概念', '2.5', '控制电路', 'Entity', '大纲', '户口', '重复', '光谷', '易读', '分辨率', 'M', '美好生活',
                  '一群', '回报', '烧烤', '批量', '必备', '加强', 'Xilinx', 'Tensorflow', '影视', '热水器', 'verification', 'relevant',
                  '发生器', '宝贝', '预处理', '直至', '账户', 'G', '工作勤奋', '保证质量', '车间', 'unity', 'services', '矢量', '私有', 'DDR',
                  'well', '修订', '电路仿真', 'BIOS', '位置', '生产流程', '城', 'Code', '社会保障', '6K', '服从安排', '歌', '更优', '首页', '商用',
                  '扩大', '外协', 'can', '02', '业务人员', '指引', '一系列', '无线通讯', '不用', '内部测试', '职满', '特色', '话', 'user', 'CNN',
                  '全新', '全局', '条理清楚', 'HIS', '不足', '公正', '布板', '职场', '注入', 'ELK', '消化', '街道', '分销', '录入', '房地产', '北路',
                  '大功率', '样板', 'jenkins', '感受', '餐厅', 'ensure', '计算机行业', '施工现场', '回复', '分工', 'CMS', '向上', '数据报表', '室内',
                  '创作', 'Pro', '既定', 'Qualifications', 'Provide', '电工证', '表现力', '交叉', '密码', 'solving', '编辑器', '图谱',
                  'netty', '动画设计', 'ADS', '现金', '融资', '自学', '科学合理', '治具', '系统监控', '作出', 'JIRA', '平衡', '广东省', '可读性',
                  'websocket', 'party', '反射', '无法', '21', '大学生', 'writing', 'security', '勘察', '机械制造', '分布式应用', '双',
                  '解读', 'extjs', 'SVM', '依法', '数值', '固定资产', 'Ext', '优异', '社群', '画图', 'Touch', '系列产品', '尺寸', 'cocos2dx',
                  '驻点', '认真仔细', '反', '详情页', 'laravel', '每周五', '新型', '可测性', '江苏', '捕捉', '诚邀', '深入分析', 'SW', '祝福', '节奏',
                  '使用者', '管理信息系统', '分发', 'Junit', '低压', '金融类', '机械设备', '省内', '宁波', '公交车', 'integration', 'AC', '编写程序',
                  'Flume', '成都市', '课件', '意图', '寻求', '无障碍', '生', '系统性', '设备设计', '碰到', 'SHELL', 'Application', '信号源',
                  '系统化', '主任', 'ISO', '务必', '质量体系', '巨大', 'CorelDraw', 'SD', 'both', '技术主管', '显示屏', '同类', '转型', '指派',
                  'CE', 'ISP', 'GPRS', '新鲜', 'NB', '合肥市', '一体', 'documentation', '阿里巴巴', '转产', '海融', 'Solr', '隐患',
                  'SIP', '400', '本行业', '机电类', 'scala', '付出', '增值', '高品质', '密切配合', '控制程序', 'jboss', '作息时间', 'DXP', '厂',
                  '之后', '人力', '听', 'power', '交易平台', 'Coreldraw', '顺利完成', '检索', '以上者', '交底', '有意', '比例', 'ITIL', '提拔',
                  '数理统计', 'JPA', 'VueJS', '常见故障', '政务', '吸引力', '讲', '数据源', '总', '婚', '相处', '翻译', '业主', '地理位置', '起薪',
                  'HAL', '定期维护', '门户网站', '生物医学', 'P2P', '航空', 'Nosql', '锁', 'training', 'MVP', 'myBatis', 'one',
                  'requirement', '审批', '发送至', '优异者', '解释', 'SE', '上网', '技术手段', '建造师', '80', '电网', '差旅', '子', '服务商',
                  'coding', 'Halcon', '人身', 'AP', '宽带', '建议书', 'AB', '乒乓球', '执着', '最低', '作用', 'Elasticsearch', 'UG',
                  'OSPF', '电脑硬件', 'core', 'Team', 'ATM', 'iphone', '抗压性', 'CMOS', '数通', '微博', 'Zigbee', '财富', '端及', '行',
                  '学士学位', 'responsibility', '予以', '易于', 'KTV', '下列', '消费类', '补丁', '将会', 'Angularjs', '选', 'CET4',
                  'Canvas', 'Freescale', '张', '气氛', '连锁', '改变', '实体', 'To', '工', 'able', '0755', '2010', '安全事件', '流片',
                  '化学', '预约', 'JavaBean', '真正', '邀请', '一致', '15000', 'AngularJs', 'TOMCAT', 'Xml', '文娱活动', 'CPLD',
                  '南京市', 'leader', '典型', '浙江', '打样', '管理人员', '暖通', '推行', 'camera', 'illustrator', '承担责任', '钉', '校验',
                  '广电', '服务质量', '耳机', '人力资源部', 'we', '服务器软件', '交际', '技术性', 'pcb', '密切', '外企', '成绩', '表彰', '愉悦', '运动会',
                  '皆', 'OOA', 'Simulink', '新增', 'JBOSS', '约束', '手续', '街', 'elasticsearch', '2.4', '辉煌', '严密', '自带',
                  'SOAP', '出发', '劳动法', '汇报工作', '签', '准时', '加速', 'ORCAD', '中小型', '中路', '安全策略', '禅道', 'designer', '163',
                  'embedded', '总体规划', 'Google', 'Sketch', '型号', 'restful', '气动', '大家庭', '多家', '超长', '知识面', '附', '集市',
                  '式样', '手', '本科生', '线路板', '下位', '物体', 'opencv', '003', '尊重', 'cadence', '数据格式', '体现', '预案', '上司', '能量',
                  '概述', 'WLAN', '服务项目', '泛微', '学科', '元旦', '广', '时尚', '足球', '哺乳', '横向', '年轻人', '遥感', '端系统', '经常性', '证',
                  '建', '消除', '滤波器', '运行状况', 'Redux', '发电', 'functional', 'Solidworks', '总结报告', 'ES5', '到达', '精密', '预',
                  '子女', '长远', '贷款', '光纤', '即时通讯', '水准', 'IDS', '工业区', '雇佣', '相信', '功放', '直达', '疑难杂症', '近期', '就餐',
                  'WebAPI', '器', '合成', '分布式服务', '职业生涯', '专心', '入库', 'FreeRTOS', 'OC', '阳光', 'Services', '观察', '中国移动',
                  '品', 'DHTML', '证明', '程序调试', '战略规划', '关系融洽', '最终用户', '电脑操作', '洽谈', '时刻', 'Builder', 'LIN', 'CentOS',
                  '初', '总公司', '咨询电话', '同学', 'SCADA', '数据库管理员', '上门', '预防', 'developing', '数据业务', '超', '项目部', 'it',
                  'WebGIS', '分析模型', '大三', '住房补贴', 'MCSE', '台式机', 'tasks', '众多', '求职', '告警', '朝九晚五', '防', '有限', '采取',
                  '欧美', '不断改进', 'f', '宽松', '现象', 'IPC', '造型', '文章', '操作技能', '新城', '白鹭', '展开', 'STM8', 'GO', '编制工作',
                  '开发周期', '控系统', '承诺', '前段', '大连', 'Development', 'MAC', 'FMEA', 'PLSQL', '特征提取', '就职', 'DCS', '心理',
                  '一金及', '添加', '愿', '支援', '儿童', '拼搏', 'postgresql', '外包', 'Manager', '娴熟', '美感', '家长', '交互方式', 'your',
                  '成品', '销售策略', '工程技术', '利润', '头脑灵活', '指挥', 'O2O', '对内', 'ABAP', '期货', '以太', '开发部', '即时', 'dreamweaver',
                  '8K', 'Extjs', 'Scrum', 'Have', '08', '5K', '带上', 'canvas', '规程', '基本技能', '收款', '疾病', '公司总部', '职务',
                  '分派', '率', '提案', '声学', 'C1', 'unity3d', '详细分析', '存储技术', '落户', 'major', '笔记本电脑', '服务化', '过滤', '计划性',
                  '并行计算', '财务管理', '一名', '访问量', '进销存', '工程部', 'PB', '助力', '地铁口', 'vuejs', '会用', 'Ethernet', 'YUI', '招募',
                  'China', '滤波', 'internal', '反映', '链路', 'plan', '评定', '商户', '找', 'maintain', 'database', '定型', '超强',
                  '心得', '锂电池', '具体实施', '强制', '趴', '及餐', 'IPS', '透明', '开关', '传动', 'than', '色彩感', '表述', 'arm', '处置', '营造',
                  '衔接', 'world', '批量生产', '报名', 'Exchange', '蓝图', '附带', '法律法规', 'Flex', '轨道交通', '百万', '嵌入式应用', 'Altera',
                  '防御', '网络服务', '兼', '步骤', '电子政务', '数据服务', '共', 'gdb', '蛋糕', '复制', 'field', 'MSP430', 'Kettle', '29',
                  'Firefox', '愉快', '平等', '顾客', '敢', '试用', '板级', '人脸', 'flow', '表单', '未', '预期', 'erp', '有微', '一同', '组内',
                  '大区', '热忱', 'Electrical', '微信端', '大楼', '夜班', '笔试', 'VBA', 'Flask', '持久', '查阅', '东软', 'Gradle', '生态系统',
                  '电子元件', 'SAAS', 'equivalent', 'PID', 'Proficient', '图书', '估算', '出游', 'learning', '身份', 'websphere',
                  '江西', '来源', '合约', 'Management', '电子器件', '下载', '期', '收银', '新闻', '动态效果', '增删', '电烙铁', 'Cocos', '牛',
                  '定期检查', 'activities', '业务培训', 'LR', '2500', '留学', '亿', 'Security', 'Modbus', '浏览', '利益', '对面', '少',
                  '龙图', '有云', 'VLAN', '听说', '维度', '江苏省', '潮流', '买', '涵盖', 'CMMI', 'processes', 'stm32', '承认', '锻炼',
                  '实物', '以内', 'ECU', '委托', '半', '导出', 'HFSS', '化有', 'BPM', '二金', '3C', '人际', 'job', '探讨', 'like', 'AGV',
                  '协会', 'Thinkphp', '贴片', '技术顾问', '全勤', 'PCI', 'My', '钱包', '摄像机', '美味', 'year', '宝安区', '检查和', '产品策划',
                  '计量', 'Express', '受理', '图文', '事故', '坊', '龙华', '附件', '收获', '没', '各级', '停车场', 'Helpdesk', 'echarts',
                  '工时', '联', '简介', 'planning', '服务中心', '要点', '激光雷达', '数控', '系统结构', '层及', '地理信息', 'easyUI', '生子', '办法',
                  '风险管理', 'ruby', '原', '玩家', '围绕', 'SDN', '房', '现实', '倍', '长', '小家电', 'global', '看到', '三方', '提倡',
                  'GitHub', '职业培训', '用法', 'openstack', '点云', '太阳能', '创业精神', '电影', 'firmware', '照片', '交接', '重大项目', '几何',
                  'Adobe', '推出', '创客', '交易所', '国企', '顶尖', '联通', '多样', '专业性', '沈阳', '大赛', '休息时间', '力量', '珠海', '独到见解',
                  'out', 'TV', 'ABB', '数字图像处理', '毫米波', '天河', '邮件系统', 'npm', '03', '移交', 'DAC', 'position', '合作开发',
                  'IOC', 'PaaS', '机遇', '工程质量', '班', '液压', '数码', '抽象思维', 'within', '正则表达式', 'DELL', '动效', '口', '化工',
                  'LOGO', 'digital', '对策', '一支', 'tensorflow', 'ipad', '拆分', '之前', 'NXP', '触觉', '短信', '产品部', '直流',
                  'Audio', '论坛', '拒绝', '万达', 'RNN', 'db2', '朋友', '愿望', '引领', '耗材', 'BGP', 'use', '整套', '细分', 'helpdesk',
                  'Appium', '一个月', '物资', 'kernel', '集成商', '避免', '资源整合', '一路', '※', '新币', '15K', '群体', '常识', 'client',
                  'Skills', '国家标准', '质地', 'reading', 'Tableau', '界面风格', 'ICT', '喜爱', '安全意识', '待人', 'SQLserver', 'ppt',
                  '10K', '悟性', '维保', '贡献者', '产', 'C51', 'springcloud', '27', '关键字', '晋升制度', 'OCP', '主从', '异常情况',
                  'Ethereum', '软件结构', '辅助工具', '水', '画面', 'SOP', '承受能力', '编排', '盘点', '竞聘', '运算', '组员', 'following',
                  'x86', 'sales', '南', '贴心', '机房设备', '马达', '健壮性', '服务器进行', '形象设计', '职员', 'electrical', 'CVS', '距离',
                  'rabbitmq', '勤恳', 'i', '卫星', '售中', '知名企业', '集团公司', 'Script', '签约', '过硬', '平时', '刻苦钻研', '网络科技', '设计规划',
                  '原创', 'EPLAN', '勇于创新', 'CISP', '减少', '联盟', 'ESB', '高层', '印刷', '研究者', '独立性', '福州', 'Postgresql',
                  'MQTT', 'Less', '用心', 'Ant', '预估', '计算机信息', 'Interface', 'MIPS', '辖区', '市内', '某种', 'SSD', '门禁系统',
                  'solr', '密切合作', '满勤奖', '控制技术', '假及', '嵌入', 'D3', '凝聚力', '备件', 'Activity', 'case', '可行性研究', '「', '唱',
                  '杭州市', '原画', 'electronic', '四大', '外观', '青年', '番', '开发方式', '轨迹', 'DFT', '√', '维持', 'Cassandra', '积分',
                  '栏目', 'reactjs', 'driver', 'Linq', '放大器', '机械工程', 'ASO', '门', '薪金', 'standards', '高质', '高精度', '有序',
                  '办事', '产品规格', '产品升级', 'PCIE', 'HCNP', 'RAC', '以后', '垂直', '广播', '报', '初始化', '灾备', '海思', '搜狗',
                  'improvement', '机台', '高保真', '音箱', 'Basic', 'spirit', 'engineers', '升职', '二本', '理财', '符合要求', '车身',
                  '版面', '帮', 'MM', '覆盖率', '家属', '播放', '关心', '通', 'this', '洁癖', '开拓精神', '用过', '序列', '拟制', '大容量', '频谱',
                  '学信', 'ansible', '客观', '主观', '网上', '做起', '相互', '熟悉业务', '重点项目', '下班', '12000', 'CorelDRAW', 'zepto',
                  '来电', '男', '展会', '商', '行动', 'VI', 'specification', '条理清晰', 'ISE', '评分', '协商', '专业化', 'Internet', '旁',
                  '市', '未知', '符合条件', '模具设计', '2014', '销售部', 'report', '口碑', '核对', '按规定', '调优有', '力强', '提示', 'Working',
                  '七险', 'TD', '装置', '表格', 'SpringMvc', '全资', 'sqlite', '夏季', '出行', '多种语言', '优美', 'KEIL', '一本', '飞', 'v',
                  '判断力', '虚拟现实', '架', '茶水', '接口定义', '依赖', 'into', '物业', '这是', '动力学', '刻苦', '间通信', '观点', '信心',
                  'implement', 'experiences', '课程体系', '项目分析', '技术指标', '商机', '周日', '爱好者', 'OEM', '孩子', '自研', 'Ubuntu',
                  '西', '金融业务', '加拿大', 'nagios', 'SASS', '幢', '显示器', '电子系统', 'Description', '福利制度', 'MAIL', '38', '物理层',
                  '设计院', '重', '学士', 'LESS', '传感', '走线', '控制卡', 'banner', 'key', 'must', '电动汽车', '无刷电机', '核查', '核算',
                  'self', 'ANDROID', '定', '周报', '电气专业', '站台', '池', '校准', '成套', 'prototype', '行业动态', 'debugging', '原件',
                  'about', '以外', 'n', '学费', '问答', '电磁', '盒', '保', '详见', 'BIM', '调动', '精美', 'Svn', '三大', 'Degree', '很快',
                  '两', '基本功能', '产品认证', '购房', '高可靠性', 'role', 'OPC', 'WCDMA', 'Solid', 'troubleshooting', '处理软件', '有人',
                  'object', '下发', '变频', '中等', '理工', '效益', '异地', 'PON', '创新性', '人文', '秉承', '意向者', '携手', '微处理器',
                  'Chinese', 'Springboot', 'Cordova', '愿景', '应答', '接线图', '屏', 'learn', 'express', '座', 'Vmware', '优先级',
                  '科技股份', '精确', '积极响应', '绘画', 'Network', 'Agile', 'ps', '网络结构', 'PHOTOSHOP', '改查', 'SPRING', '有道', '专用',
                  'through', 'Fluent', 'make', '分词', 'improve', '郑州市', '国家所有', '红外', '事务处理', '十分', 'PE', '电脑设备', '构图',
                  '指标体系', '山东', 'motivated', 'Nagios', '++', 'Auto', '品德', 'Sass', 'ReactNative', 'AMD', '软件程序', '调优及',
                  '独当一面', '热点', '抽奖', '倾听', '托管', '短', '信令', '盈利', '飞行', 'WAP', '热门', '选用', 'verilog', '使命', '027',
                  'demo', 'oral', 'objective', 'Ansible', '领导力', 'appium', 'CUDA', '能动性', '周年', '厦门', '各项任务', '意外保险',
                  '原厂', '中兴', 'KPI', '经销商', 'Zend', '图书馆', 'Rose', 'PowerPoint', '程序语言', '发行', 'PYTHON', 'Leader', '经典',
                  'NAND', '8k', 'RTSP']
    stopwords1 = [line.rstrip() for line in open('/media/hadoop/code/bd_web/db_web/sp/中文停用词库.txt')]
    stopwords2 = [line.rstrip() for line in open('/media/hadoop/code/bd_web/db_web/sp/哈工大停用词表.txt')]
    stopwords3 = [line.rstrip() for line in open('/media/hadoop/code/bd_web/db_web/sp/四川大学机器智能实验室停用词库.txt')]
    stopwords4 = [' ', '高薪', '招', '吃', '爆棚', '芜湖', '郑州', '合肥', '过万', '饭补', r'\xa0', '天津', '新手', '新人', '地铁', '名企', '学徒',
                  '3500',
                  '|', '\xa0', '年', '~', '●', '◆']
    stopwords = stopwords1 + stopwords2 + stopwords3 + stopwords4
    seg_list = jieba.cut(str(text), cut_all=False)
    meaninful_words=[]
    for word in seg_list:
        if word not in stopwords:
            if word in valid_word:
                meaninful_words.append(word)
    return meaninful_words




def mon_wa_trans(mon_wa):
    if int(mon_wa)<=4000:
        return 1
    elif int(mon_wa)<=7000:
        return 2
    elif int(mon_wa)<=10000:
        return 3
    elif int(mon_wa)<=13000:
        return 4
    elif int(mon_wa)<=15000:
        return 5
    else:
        return 6

def work_exp_trans(work_exp):
    if str(work_exp)=='10年以上':
        return 1
    elif '10年' in str(work_exp):
        return 1
    elif str(work_exp)=='5-10年':
        return 2
    elif '5-' in str(work_exp):
        return 2
    elif '8-' in str(work_exp):
        return 2

    elif str(work_exp)=='3-5年':
        return 3
    elif '3-' in str(work_exp):
        return 3
    elif str(work_exp)=='1-3年':
        return 4
    elif '1' in str(work_exp):
        return 4
    elif '2' in str(work_exp):
        return 4
    elif str(work_exp)=='无经验' or str(work_exp)=='不限':
        return 5
    elif '无' in str(work_exp):
        return 5
    else:
        return 5
def edu_trans(education):
    if str(education)=='1年以下' or str(education)=='1-3年' or str(education)=='3-5年' or str(education)=='5-10年' or str(education)=='10年以上' or str(education)=='无经验':
        return '不限'
    else:
        return str(education)

def new_edu_trans(education):
    if str(education)=='博士':
        return 1
    elif str(education)=='硕士':
        return 2
    elif str(education)=='本科':
        return 3
    elif str(education)=='大专' or str(education)=='专科':
        return 4
    elif str(education)=='高中':
        return 5
    else:
        return 6



def features_trans(tuple1):
    return LabeledPoint(int(tuple1[0]),DenseVector(tuple1[1]))


def acc_rate(x):
    if x[0]==x[1] or x[0]-1==x[1] or x[0]+1==x[1]:
        return True
    else:
        return False


def lable_filter(lable):
    # lst=['供应链总监','物流总监','机机长/副机长','司仪','行长/副行长','高级管理','总裁','房地产','首席财务','印染','预订员','']
    lower_lst=['web','系统工程师','高级软件工程师','软件工程师','软件','软件开发','手机应用','计算机','硬件',]
    sec_lst=['数据挖掘','数据库工程师','单片机','嵌入式硬件','嵌入式软件','ios','安卓','android','硬件工程师','系统测试','运维','前端',
             'java开发',]
    high_lst=['高级硬件工程','区块链','大数据','深度学习','人工智能','机器视觉','算法','ui',
              '游戏开发','网络管理','网页设计/制作/美工','软件测试','通信','电子技术','机器人','电气工程师','自动化','电路工程',
              'cocos2d-x','物联网','系统架构','erp实施','电子工程','系统集成','集成电路','硬件测试','数据分析','射频工程','网络安全',
              '半导体','flash']
    for i in high_lst:
        if i in str(lable).lower():
            return i
        else:
            continue
    for i in sec_lst:
        if i in str(lable).lower():
            return i
        else:
            continue
    for i in lower_lst:
        if i in str(lable).lower():
            return i
        else:
            continue
    return '1'
#
def f(x):
    rel={}
    rel['features']=Vectors.dense(x[1])
    rel['label']=int(x[0])
    return rel

def result_trans(result):
    import random
    result=int(result)
    if result==1:
        return random.randint(3000,4000)
    elif result==2:
        return random.randint(5000,7000)
    elif result==3:
        return random.randint(8000,10000)
    elif result==4:
        return random.randint(10000,13000)
    elif result==5:
        return random.randint(13000,16000)
    else:
        return random.randint(20000,22000)



        # if int(mon_wa) <= 4000:
        #     return 1
        # elif int(mon_wa) <= 7000:
        #     return 2
        # elif int(mon_wa) <= 10000:
        #     return 3
        # elif int(mon_wa) <= 13000:
        #     return 4
        # elif int(mon_wa) <= 15000:
        #     return 5
        # else:
        #     return 6